&НаСервере
Процедура ОбработкаПроведения()
    Для Каждого Строка Из Сотрудники Цикл
        Принял = Строка.Сотрудник.ПолучитьОбъект();
        Принял.ДатаНачалаИС = Дата;  // Дата документа
        
        // Расчет даты окончания ИС
        Если Контракт.ИспытательныйСрок > 0 Тогда
            Принял.ДатаКонцаИС = Дата + Контракт.ИспытательныйСрок;
        Иначе
            // Если испытательного срока нет
            Принял.ДатаКонцаИС = '00010101'; // Минимальная дата
        КонецЕсли;
        
        Принял.РезультатИС = ""; // Сброс результата
        Принял.Записать();
    КонецЦикла;
КонецПроцедуры